Examinator/src/InformationRegisters/ЗаявкиНаОбучениеСУО/ЗаявкиНаОбучениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаОбучениеСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЗаявки</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметЗаявки</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ЗаявкиНаОбучениеСУО/ManagerModule.bsl
Функция Заявка(Знач ПредметЗаявки, Знач Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкиНаОбучениеСУОСрезПоследних.Регистратор КАК Заявка,
		|	ЗаявкиНаОбучениеСУОСрезПоследних.Статус
		|ИЗ
		|	РегистрСведений.ЗаявкиНаОбучениеСУО.СрезПоследних(
		|			,
		|			Пользователь = &Пользователь
		|				И ПредметЗаявки = &ПредметЗаявки) КАК ЗаявкиНаОбучениеСУОСрезПоследних";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПредметЗаявки", ПредметЗаявки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат Новый Структура("Заявка, Статус", ВыборкаДетальныеЗаписи.Заявка, ВыборкаДетальныеЗаписи.Статус);
		
	КонецЕсли;
	
КонецФункции
